/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "Se ha producido un error al crear un nuevo álbum. Comprueba tu conexión a internet e inténtalo de nuevo más tarde.";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "Se ha producido un error al subir una imagen a los álbumes web de Picasa. Comprueba tu conexión a internet e inténtalo de nuevo más tarde.";

/* Could not create a new album */
"Could not create a new album" = "No se ha podido crear un nuevo álbum";

/* Could not upload an image */
"Could not upload an image" = "No se ha podido subir una imagen";
